app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
  def index
    @sort_by=params[:sort_by]
    @all_ratings = Movie.all_ratings
    @ratings = params[:ratings]
    if !@ratings and params[:commit] != "Refresh"
      @ratings = Hash.new
      @all_ratings.each do |rating|